{
  "starter": {
    "3": [
      {
        "pattern": "Nです\nN1はN2です",
        "example": "トンです。\n私はマルシアです。"
      },
      {
        "pattern": "【場所】から来ました",
        "example": "ブラジルから来ました。"
      },
      {
        "pattern": "Nは？",
        "example": "お名前は？"
      },
      {
        "pattern": "Sか？",
        "example": "みなさんは、友だちですか？"
      },
      {
        "pattern": "Nも",
        "example": "ケマラさんも、ベトナムからですか？"
      },
      {
        "pattern": "Nじゃないです",
        "example": "ベトナムじゃないです。"
      }
    ],
    "4": [
      {
        "pattern": "N1とN2",
        "example": "夫と子どもです。"
      },
      {
        "pattern": "【疑問表現】ですか？",
        "example": "何歳ですか？"
      },
      {
        "pattern": "【場所】に住んでいます",
        "example": "家族は、フィリピンに住んでいます。"
      },
      {
        "pattern": "N1のN2",
        "example": "私の母です。\nペットのジョンです。"
      }
    ],
    "5": [
      {
        "pattern": "Nが好きです",
        "example": "肉と野菜が好きです。"
      },
      {
        "pattern": "Nは好きじゃないです",
        "example": "魚は好きじゃないです。"
      },
      {
        "pattern": "Nはちょっと…",
        "example": "わさびは、ちょっと…。"
      },
      {
        "pattern": "V-ますか？（マス形）",
        "example": "お茶、飲みますか？"
      },
      {
        "pattern": "V-る？（辞書形）",
        "example": "何、飲む？"
      },
      {
        "pattern": "NをV-ます",
        "example": "シリアルを食べます。"
      },
      {
        "pattern": "（Nは）V-ません",
        "example": "私は、朝ご飯は、あまり食べません。"
      },
      {
        "pattern": "（Nは）V-ないです",
        "example": "私も、食べないです。"
      },
      {
        "pattern": "あまりV-ません ＜頻度＞",
        "example": "朝ご飯は、あまり食べません。"
      }
    ],
    "6": [
      {
        "pattern": "N、お願いします\nN、ください",
        "example": "ホットコ-ヒ-、お願いします。\nこれ、ください。"
      },
      {
        "pattern": "Nにします",
        "example": "私は、うどんにします。"
      },
      {
        "pattern": "N、【数】お願いします\nN、【数】ください",
        "example": "生ビ-ル3つと、ウ-ロン茶1つ、お願いします。\n枝豆2つ、ください。"
      },
      {
        "pattern": "N（は）ありますか？",
        "example": "マヨネ-ズ、ありますか？"
      }
    ],
    "7": [
      {
        "pattern": "ここは【場所】です",
        "example": "ここは玄関です。"
      },
      {
        "pattern": "【場所】にNがあります",
        "example": "ここに階段があります。"
      },
      {
        "pattern": "【場所】にNが【数】あります",
        "example": "１階に部屋が4つあります。"
      },
      {
        "pattern": "（Nは）ありません／ないです",
        "example": "トースターはありません。\nベッドはないです。"
      },
      {
        "pattern": "ナA-です\nイA-いです",
        "example": "家は静かです。\nちょっとせまいです。"
      },
      {
        "pattern": "ナA-じゃないです\nイA-くないです",
        "example": "アパ-トは、あまり静かじゃないです。\n寮は広くないです。"
      }
    ],
    "8": [
      {
        "pattern": "【場所】でV-ます",
        "example": "ここで着替えます。"
      },
      {
        "pattern": "【人】は【場所】にいます",
        "example": "山田さんは、食堂にいます。"
      },
      {
        "pattern": "（【人】は)いません／いないです",
        "example": "辻さんは、いませんね。\nアマンダさん、いないですね。"
      },
      {
        "pattern": "【もの】は【ここ／そこ／あそこ】にあります",
        "example": "はさみは、そこにあります。"
      },
      {
        "pattern": "Nの【位置】にあります",
        "example": "引き出しの中にあります。"
      }
    ],
    "9": [
      {
        "pattern": "【時間】に／ごろV-ます",
        "example": "5時に起きます。\n11時ごろ寝ます。"
      },
      {
        "pattern": "【時間】から【時間】まで",
        "example": "12時から1時まで、昼休みです。"
      },
      {
        "pattern": "【日時】がいいです",
        "example": "私は、土曜日がいいです。"
      }
    ],
    "10": [
      {
        "pattern": "V-てください\nV-て",
        "example": "ちょっと、手伝ってください。\nそこのドライバ-、取って。"
      },
      {
        "pattern": "V-てくれる？",
        "example": "窓、閉めてくれる？"
      },
      {
        "pattern": "Nですね　＜確認＞",
        "example": "Ａ：これ、コピ-、30枚お願い。\nＢ：はい、30ですね。"
      },
      {
        "pattern": "N、貸してください",
        "example": "ホチキス、貸してください。"
      },
      {
        "pattern": "N、借りてもいいですか？",
        "example": "すみません。借りてもいいですか？"
      },
      {
        "pattern": "N、いいですか？",
        "example": "これ、いいですか？"
      },
      {
        "pattern": "N、ありますか？",
        "example": "スマホの充電器、ありますか？"
      }
    ],
    "11": [
      {
        "pattern": "Nは何ですか？",
        "example": "趣味は、何ですか？"
      },
      {
        "pattern": "どんなN",
        "example": "どんなスポ-ツが好きですか？"
      },
      {
        "pattern": "あまりナA-じゃないです／イA-くないです　＜程度＞",
        "example": "スポ-ツは、あまり好きじゃないです。"
      },
      {
        "pattern": "【いつも／たいてい／よく／ときどき】V-ます　＜頻度＞",
        "example": "休みの日は、たいてい、映画を見ます。"
      },
      {
        "pattern": "【あまり／ぜんぜん】V-ません　＜頻度＞",
        "example": "スポ-ツは、ぜんぜんしないね。"
      },
      {
        "pattern": "【人】と／【場所】でV-ます",
        "example": "夫と公園でテニスをします。"
      }
    ],
    "12": [
      {
        "pattern": "【日時】に【場所】で【イベント】があります",
        "example": "日曜日に、さくら公園でタイフェスティバルがありますね。"
      },
      {
        "pattern": "Nに行きます",
        "example": "明日の忘年会に行きますか？"
      },
      {
        "pattern": "V-ませんか？",
        "example": "いっしょに行きませんか？"
      },
      {
        "pattern": "V-ましょう",
        "example": "また今度行きましょう。"
      },
      {
        "pattern": "V-に行きます",
        "example": "みんなで、いっしょに焼肉を食べに行きませんか？"
      }
    ],
    "13": [
      {
        "pattern": "この【乗り物】は【場所】に行きますか？",
        "example": "このバスは、空港に行きますか？"
      },
      {
        "pattern": "ここは【場所】ですか？",
        "example": "ここは、どこですか？"
      },
      {
        "pattern": "【乗り物】で来ます",
        "example": "バイクで来ます。"
      },
      {
        "pattern": "【時間／期間】かかります",
        "example": "1時間半かかります。"
      },
      {
        "pattern": "【場所】で【乗り物】に乗ります\n【場所】で【乗り物】を降ります",
        "example": "ここから、12番のバスに乗ります。\nバスセンタ-で、バスを降ります。"
      },
      {
        "pattern": "【場所】から【場所】まで",
        "example": "ここから新みなと駅まで、電車に乗ります。"
      }
    ],
    "14": [
      {
        "pattern": "【場所】にN（は）ありますか？",
        "example": "この近くに、コンビニはありますか？"
      },
      {
        "pattern": "Nの【位置】にいます",
        "example": "今、改札の前にいます。"
      },
      {
        "pattern": "ナA-なNですね\nイA-いNですね",
        "example": "にぎやかな通りですね。\n広い公園ですね。"
      }
    ],
    "15": [
      {
        "pattern": "Nがほしいんですが",
        "example": "電池がほしいんですが、どこで買えますか？\n延長コ-ドがほしいんですが…。"
      },
      {
        "pattern": "ナA-ですね\nイA-いですね\nナA！\nイA-い!",
        "example": "このコート、おしゃれですね。\nこの傘、おもしろいですね。\nこのコート、すてき！\nこのバッグ、かわいい！"
      }
    ],
    "16": [
      {
        "pattern": "【これ／それ／あれ】（は）いくらですか？",
        "example": "これ、いくらですか？"
      },
      {
        "pattern": "【この／その／あの】N",
        "example": "そのカレンダー、いくらですか？"
      },
      {
        "pattern": "【数量】ずつ",
        "example": "チョコレートケーキとチーズケーキ、2個ずつお願いします。"
      }
    ],
    "17": [
      {
        "pattern": "V-ました\nV-ませんでした",
        "example": "家でゆっくりしました。\n週末は、何もしませんでした。"
      },
      {
        "pattern": "何もV-ませんでした\nどこにもV-ませんでした",
        "example": "週末は、何もしませんでした。\n私は、どこにも行きませんでした。"
      },
      {
        "pattern": "ナA-でした",
        "example": "「ゴジラ」は、まあまあでした。"
      },
      {
        "pattern": "イA-かったです",
        "example": "国際フェスティバルは、とても楽しかったです。"
      },
      {
        "pattern": "Nでした",
        "example": "とてもいい天気でした。"
      },
      {
        "pattern": "N-じゃなかったです\nナA-じゃなかったです\nイA-くなかったです",
        "example": "温泉に入りました。でも、露天風呂じゃなかったです。\n富士山に登りました。あまり大変じゃなかったです。\nお客さんは、あまり多くなかったです。"
      }
    ],
    "18": [
      {
        "pattern": "V-たいです",
        "example": "炊飯器が買いたいです。"
      },
      {
        "pattern": "どこかV-ます",
        "example": "どこか旅行したいです。"
      },
      {
        "pattern": "S1。あと、S2。",
        "example": "雪が見たいです。あと、温泉に入りたいです。"
      },
      {
        "pattern": "【場所】へ行きます",
        "example": "京都へ行きたいです。"
      },
      {
        "pattern": "S1。それから、S2。",
        "example": "露天風呂に入りました。それから、温泉の近くで、鶏の天ぷらを食べました。"
      },
      {
        "pattern": "S1。それに、S2。",
        "example": "気持ちよかったです。それに、景色もきれいでした。"
      },
      {
        "pattern": "S1。でも、S2。",
        "example": "おいしかったです。でも、ちょっと高かったです。"
      }
    ]
  },
  "elementary1": {
    "1": [
      {
        "pattern": "丁寧体・普通体",
        "example": "お久しぶりです。お元気ですか？\n久しぶり。元気？"
      },
      {
        "pattern": "【期間】になります",
        "example": "日本に来て1年になります。"
      },
      {
        "pattern": "【時点】（に）来ました",
        "example": "去年の9月に来ました。"
      },
      {
        "pattern": "V-ています ①",
        "example": "日本では、何をしていますか？"
      }
    ],
    "2": [
      {
        "pattern": "V-ることです",
        "example": "趣味は映画を見ることです。"
      },
      {
        "pattern": "V-るのが好きです",
        "example": "ゲームをするのが好きです。"
      },
      {
        "pattern": "【人】と【場所】でV-ます",
        "example": "休みの日は、たいてい友だちと体育館でバドミントンをします。"
      },
      {
        "pattern": "V1-て、V2",
        "example": "毎週、夕方までバドミントンをして、そのあと、みんなでご飯を食べます。"
      },
      {
        "pattern": "V-ています ②",
        "example": "いけばなを習っています。"
      },
      {
        "pattern": "Nができます",
        "example": "日本語、英語、フィリピノ語、スペイン語ができます。"
      }
    ],
    "3": [
      {
        "pattern": "Nに／ナA-に／イA-く　なります",
        "example": "春は桜の花が咲きます。暖かくなります。"
      },
      {
        "pattern": "いちばん　ナA-です／イA-いです",
        "example": "秋がいちばん好きです。"
      },
      {
        "pattern": "イA-い のが 好きです",
        "example": "私は暑いのが好きです。"
      },
      {
        "pattern": "イA-い のが 苦手です",
        "example": "寒いのが苦手です。"
      },
      {
        "pattern": "ナA-です／イA-いです から",
        "example": "秋が好きです。もみじの景色がきれいですから。"
      },
      {
        "pattern": "S1から、S2",
        "example": "暑いのが大好きですから、夏が好きです。"
      },
      {
        "pattern": "N1やN2",
        "example": "海や山で遊ぶのも楽しいです。"
      },
      {
        "pattern": "N1とか（N2とか）",
        "example": "秋は果物がおいしいですよね。ぶどうとか梨とか。"
      }
    ],
    "4": [
      {
        "pattern": "Sね　＜共感＞",
        "example": "今日はいい天気ですね。"
      },
      {
        "pattern": "非過去・過去",
        "example": "昨日はすごい雨でしたね。"
      },
      {
        "pattern": "V-ています ③",
        "example": "今も少し雨が降っています。"
      },
      {
        "pattern": "N／ナA-／イA-い／V-る　でしょう",
        "example": "明日は晴れるでしょう。"
      }
    ],
    "5": [
      {
        "pattern": "イA-くて、～",
        "example": null
      },
      {
        "pattern": "ナA-で、～",
        "example": "この町は、とてもにぎやかで、便利です。"
      },
      {
        "pattern": "Nで、～",
        "example": null
      },
      {
        "pattern": "イA-いけど、～",
        "example": null
      },
      {
        "pattern": "ナA-だけど、～",
        "example": "たちばな公園は、場所は不便だけど、きれいですよ。"
      },
      {
        "pattern": "Nだけど、～",
        "example": null
      },
      {
        "pattern": "V-ることができます",
        "example": "一年中、いろいろな花を見ることができます。"
      }
    ],
    "6": [
      {
        "pattern": "Nに行きたいんですが…",
        "example": "マルイチデパートに行きたいんですが…。"
      },
      {
        "pattern": "V-て、～",
        "example": "この道をまっすぐ行って、2つ目の信号を左に曲がってください。"
      },
      {
        "pattern": "N1じゃなくて、N2",
        "example": "1つ目じゃなくて、2つ目です。"
      }
    ],
    "7": [
      {
        "pattern": "Nはどうですか？",
        "example": "6時はどうですか？"
      },
      {
        "pattern": "Nでもいいですか？",
        "example": "6時半でもいいですか？"
      },
      {
        "pattern": "Nで、～　＜原因・理由＞",
        "example": "事故で電車が止まりました。"
      },
      {
        "pattern": "V-て、～　＜原因・理由＞",
        "example": "ねぼうして、今、起きました。"
      }
    ],
    "8": [
      {
        "pattern": "もうV-ました",
        "example": "新しいアウトレットモール、もう行きましたか？"
      },
      {
        "pattern": "V-たことがあります",
        "example": "プロレスを見たことがありますか？"
      },
      {
        "pattern": "V-に行きませんか？",
        "example": "いっしょに食べに行きませんか？"
      },
      {
        "pattern": "Nの前に、～",
        "example": "食事の前に、お金をおろしたいんですが…。"
      },
      {
        "pattern": "Nのあと（で）、～",
        "example": "買い物のあとで、ゲームコーナーに行きませんか？"
      },
      {
        "pattern": "V-たいんですが…",
        "example": "ジョギングシューズを買いたいんですが…。"
      }
    ],
    "9": [
      {
        "pattern": "Nで　＜手段＞",
        "example": "アニメで日本語を勉強しました。"
      },
      {
        "pattern": "N1はN2がナA-です／イA-いです ①",
        "example": "日本語は文字が難しいです。"
      },
      {
        "pattern": "NはV-るのがナA-／イA-いです ①",
        "example": "日本語は話すのが大変です。"
      },
      {
        "pattern": "N1は、～。（でも、）N2は、～。　＜対比＞",
        "example": "日本語は、読むのは少し難しいです。でも、会話は得意です。"
      },
      {
        "pattern": "V-てもらえませんか？",
        "example": "日本語をチェックしてもらえませんか？"
      },
      {
        "pattern": "V-方",
        "example": "この書類の書き方がよくわかりません。"
      }
    ],
    "10": [
      {
        "pattern": "V-てみたいんですが…",
        "example": "合気道をやってみたいんですが…。"
      },
      {
        "pattern": "【期間】（に）～回",
        "example": "日本語クラスは週に1回です。"
      },
      {
        "pattern": "V-ましょうか？",
        "example": "教室のチラシを持って来ましょうか？"
      },
      {
        "pattern": "聞き返し",
        "example": "すみません。「ぼご」は、どういう意味ですか？"
      },
      {
        "pattern": "Nのとき、～",
        "example": "高校のとき、少し日本語を勉強しました。"
      },
      {
        "pattern": "イA-いとき、～",
        "example": "若いとき、よく旅行しました。"
      },
      {
        "pattern": "ナA-なとき、～",
        "example": "暇なとき、料理を作ります。"
      }
    ],
    "11": [
      {
        "pattern": "V-て行きます",
        "example": "肉と野菜は、私が買って行きますよ。"
      },
      {
        "pattern": "V-て来ます",
        "example": null
      },
      {
        "pattern": "N1とN2（と）、どっちがいいですか？\nS。どれがいいですか？",
        "example": "チョコレートケーキとチーズケーキ、どっちがいいですか？\nお茶、いろいろありますね。どれがいいですか？"
      },
      {
        "pattern": "Nのほうがいいです",
        "example": "塩のほうがいいです。"
      },
      {
        "pattern": "【疑問詞】でもいいです",
        "example": "A：何が食べたいですか。\nB：何でもいいです。"
      }
    ],
    "12": [
      {
        "pattern": "ナA-／イA- そうです",
        "example": "そのお弁当、おいしそうですね。"
      },
      {
        "pattern": "ナA-／イA- そうなN",
        "example": "それ、辛そうな料理ですね。"
      },
      {
        "pattern": "イA-くて、～\nイA-くなくて、～",
        "example": "この卵焼き、甘くて、おいしいですね。\n茶碗蒸し、甘くなくて、おいしいですよ。"
      },
      {
        "pattern": "V-てみます",
        "example": "よかったら、この卵焼き、食べてみてください。"
      },
      {
        "pattern": "自動詞\n他動詞",
        "example": "鶏肉とか、エビとか、きのことかが入ってます。\nときどき、銀杏も入れますよ。"
      },
      {
        "pattern": "イA-くないですか？",
        "example": "味は、うすくないですか？"
      }
    ],
    "13": [
      {
        "pattern": "～んですが…",
        "example": "会議室の電気がつかないんですが…。"
      },
      {
        "pattern": "V-そうです",
        "example": "どのぐらいかかりそうですか？"
      },
      {
        "pattern": "V-たいとき、～",
        "example": "両面コピーしたいときは、どうすればいいですか？"
      },
      {
        "pattern": "V-ると、～",
        "example": "このスタートボタンを押すと、コピーが始まります。"
      },
      {
        "pattern": "はい、【否定文】／いいえ、【肯定文】",
        "example": "A：コピー機、使ったことないですか？\nB：はい、ないです。"
      }
    ],
    "14": [
      {
        "pattern": "Nで、～／ナA-で、～／イA-くて、～／V-て、～　＜原因・理由＞",
        "example": "道が混んでいて、ぜんぜん動きません。\n昨日は、休んですみませんでした。"
      },
      {
        "pattern": "S1。それで、S2",
        "example": "これから病院に行きます。それで、少し遅刻します。"
      },
      {
        "pattern": "V-てもいいですか？",
        "example": "トイレに行って来てもいいですか？"
      },
      {
        "pattern": "V-てもいいでしょうか？",
        "example": "明日の午後、早退してもいいでしょうか？"
      },
      {
        "pattern": "V-なければなりません",
        "example": "ちょっと、役所に行かなければならないんです。"
      },
      {
        "pattern": "～んです ①",
        "example": "東京から、国の友だちが来るんです。"
      }
    ],
    "15": [
      {
        "pattern": "～んです ②",
        "example": "昨日から38度の熱があって、のどがすごく痛いんです。"
      },
      {
        "pattern": "V-ないでください",
        "example": "今週は仕事を休んで、できるだけ人に会わないでください。"
      },
      {
        "pattern": "V（普通形）＋N ①",
        "example": "こちらは、せきを抑える薬です。"
      },
      {
        "pattern": "V-る前に、～",
        "example": "1日1回、寝る前に飲んでください。"
      },
      {
        "pattern": "V-たあと、～",
        "example": "飲むと、眠くなります。飲んだあと、運転しないでくださいね。"
      },
      {
        "pattern": "～とき（に）、～",
        "example": "この薬は、痛くてがまんできないときに、飲んでください。"
      }
    ],
    "16": [
      {
        "pattern": "V-るといいです（よ）",
        "example": "よく眠れないときは、ぬるいお風呂にゆっくり入るといいですよ。"
      },
      {
        "pattern": "V-すぎます",
        "example": "昨日、飲みすぎました。"
      },
      {
        "pattern": "V1-たり、V2-たり（します）",
        "example": "ジョギングしたり、ときどき家でヨガをしたりしてます。"
      },
      {
        "pattern": "V-るようにしています",
        "example": "できるだけ、野菜をたくさん食べるようにしています。"
      },
      {
        "pattern": "V-ないように しています",
        "example": "健康のために、食べすぎないようにしています。"
      }
    ],
    "17": [
      {
        "pattern": "V（普通形）＋N ②",
        "example": "ネパールから持って来た飾りです。"
      },
      {
        "pattern": "【人】に【物】をもらいます",
        "example": "このマグカップ、誕生日に、友だちにもらったんです。"
      },
      {
        "pattern": "【人】が【物】をくれます",
        "example": "これは、兄がくれたお守りです。"
      }
    ],
    "18": [
      {
        "pattern": "S（普通形）そうです",
        "example": "お子さんが生まれたそうですね。"
      },
      {
        "pattern": "【人】に【物】をあげます",
        "example": "アナさんに何かプレゼントをあげませんか？"
      },
      {
        "pattern": "S（普通形）と言っていました",
        "example": "アナさん、前に、焼き鳥が大好きだと言っていました。"
      },
      {
        "pattern": "S（普通形）と思います",
        "example": "もっと、思い出に残るものがいいと思います。"
      }
    ]
  },
  "elementary2": {
    "1": [
      {
        "pattern": "N1というN2",
        "example": "ホアは「花」という意味です。"
      },
      {
        "pattern": "V-たばかりです",
        "example": "先週、日本に来たばかりです。"
      },
      {
        "pattern": "V-ていました",
        "example": "ベトナムでは、ホテルで働いていました。"
      },
      {
        "pattern": "それ／そこ　＜文脈指示＞",
        "example": "ジャワ島に、ジョグジャカルタという大きい町があります。ウォノソボは、そこから、バスで4時間ぐらいです。"
      },
      {
        "pattern": "～て、～\n～から、～\n～けど、～\n＜2つの文を1つにする＞",
        "example": "お茶の畑がたくさんあって、のんびりしています。\nウランバートルは首都だから、都会ですよ。\n首都ではないけど、とてもにぎやかです。"
      }
    ],
    "2": [
      {
        "pattern": "N1はN2が ナA-です／イA-いです　②",
        "example": "江口さんは、髪が短いです。"
      },
      {
        "pattern": "V-ている＋人",
        "example": "ナインさんは、帽子をかぶっている人です。\n加藤さんは、あそこで、コピーをしている人です。"
      },
      {
        "pattern": "Sよ",
        "example": "原さんは、座って、本を読んでる人ですよ。"
      },
      {
        "pattern": "Sし、～",
        "example": "三船敏郎は、演技が上手だし、本当にかっこいいです。"
      }
    ],
    "3": [
      {
        "pattern": "S1ので、S2",
        "example": "今日は自転車で来たので、飲めないんです。"
      },
      {
        "pattern": "Sよね",
        "example": "おすし、わさび、入ってますよね。"
      },
      {
        "pattern": "Nで～",
        "example": "A：テーブルと座敷がございますが…。　\nB：テーブルでお願いします。"
      },
      {
        "pattern": "ナA-な／イA-い／V-る のは、Nです",
        "example": "人気があるのは、お刺身定食です。"
      }
    ],
    "4": [
      {
        "pattern": "Nなら、～",
        "example": "A：この近くに、おすすめの店がありますか？\nB：この近くなら、「平兵衛」がおすすめです。"
      },
      {
        "pattern": "V-て、～　＜方法＞",
        "example": "こちらの野菜の天ぷらは、つゆにつけて食べてください。"
      },
      {
        "pattern": "V-ないで、～　＜方法＞",
        "example": "エビはつゆにつけないで、塩をかけて食べてください。"
      },
      {
        "pattern": "V-ちゃだめです",
        "example": "一度に、そんなにたくさんお肉を入れちゃだめですよ。"
      },
      {
        "pattern": "V-てから、 ～",
        "example": "うどんは、お肉と野菜を食べてから、入れましょう。"
      },
      {
        "pattern": "S1が、S2",
        "example": "お店は新しくてきれいですが、お昼は混んでいます。"
      }
    ],
    "5": [
      {
        "pattern": "V-（られ）ます　＜可能形①＞",
        "example": "新鮮なカニとかウニとか食べられますよ。"
      },
      {
        "pattern": "～ところ",
        "example": "遊べるところはありますか？"
      },
      {
        "pattern": "S（普通形） って聞きました\nS（普通形） って言っていました",
        "example": "うどんがおいしいって聞きました。\nバスが安くて便利だって先輩が言ってました。"
      },
      {
        "pattern": "【疑問詞】V-たらいいですか？",
        "example": "日光に行くんですけど、何で行ったらいいですか？"
      },
      {
        "pattern": "V-たほうがいいです",
        "example": "厚い上着を持って行ったほうがいいですよ。"
      },
      {
        "pattern": "V-ないほうがいいです",
        "example": "できれば、日曜日は行かないほうがいいですよ。"
      }
    ],
    "6": [
      {
        "pattern": "V-るつもりです",
        "example": "明日は、中禅寺湖に行くつもりです。"
      },
      {
        "pattern": "V-（られ）て、～",
        "example": "いろいろなところに行けて、よかったです。"
      },
      {
        "pattern": "V-（られ）なくて、～",
        "example": "ショーが見られなくて、残念でした。"
      },
      {
        "pattern": "S1し、S2し、～",
        "example": "海で泳げたし、船に乗れたし、楽しかったです。"
      },
      {
        "pattern": "V-る／V-ている／V-た とき、～",
        "example": "道を歩いているとき、リスを見ました。\nウミネコが近くに来たとき、ちょっとこわかったです。"
      },
      {
        "pattern": "【人】と【人数】で",
        "example": "友だちと2人でハウステンボスに行って来ました。"
      }
    ],
    "7": [
      {
        "pattern": "～たら、～",
        "example": "雨が降ったら、盆踊りは日曜日にやるよ。\n盆踊りが終わったら、いっしょに居酒屋に行きましょう。"
      },
      {
        "pattern": "V-（ら）れます　＜受身①＞",
        "example": "7月14日、「ひかりホール」において、コンサートが開催されます。"
      },
      {
        "pattern": "V-（られ）ます　＜可能形②＞",
        "example": "盆踊りは簡単だから、だれでも踊れますよ。"
      }
    ],
    "8": [
      {
        "pattern": "もうV-ました",
        "example": "A：スピーチコンテストは、もう始まりましたか？"
      },
      {
        "pattern": "まだV-て（い）ません",
        "example": "B:まだ始まってません。"
      },
      {
        "pattern": "まだV-ます",
        "example": "イベント、まだやってますか？"
      },
      {
        "pattern": "【疑問詞】＋S（普通形）か、～",
        "example": "明日のフリーマーケットは、何時からか、わかりますか？"
      }
    ],
    "9": [
      {
        "pattern": "～んですか？",
        "example": "成人の日は、何をするんですか？"
      },
      {
        "pattern": "Nしか+否定文",
        "example": "乗り物に3つしか乗れませんでした。"
      },
      {
        "pattern": "Nだけ",
        "example": "今年は、1日だけ実家に帰りました。"
      },
      {
        "pattern": "V-たりして、～",
        "example": "友だちといっしょに買い物をしたりして、楽しかったです。"
      },
      {
        "pattern": "V-なくちゃならない",
        "example": "甥や姪にお年玉をあげなくちゃならないし、大変でした。"
      },
      {
        "pattern": "V-れます　＜可能形③＞",
        "example": "DVDもたくさん見れました。\n久しぶりに、実家の母の料理を食べれてよかったです。"
      },
      {
        "pattern": "S（普通形）+人が～\nS（普通形）+人も～",
        "example": "春節は、田舎に帰る人が多いです。\n最近では、海外に旅行する人もいます。"
      },
      {
        "pattern": "V-ながら、～",
        "example": "ソンクラーンは、町を歩きながら、みんなで水をかけ合います。"
      },
      {
        "pattern": "Nによって",
        "example": "レバランは、年によって違います。"
      }
    ],
    "10": [
      {
        "pattern": "【疑問詞】V-ばいいですか？",
        "example": "お葬式には、何を持っていけばいいですか？"
      },
      {
        "pattern": "V-てはいけません／だめです\nVちゃいけません／だめです",
        "example": "信号が赤のときは、横断歩道を渡ってはいけませんよ。\nバスの中では、話しちゃだめだよね。"
      },
      {
        "pattern": "V-なくちゃ",
        "example": "食器は自分で片付けなくちゃ。"
      },
      {
        "pattern": "V-るように、～",
        "example": "次の人がすぐに席に座れるように、食器を片付けます。"
      },
      {
        "pattern": "V-ないように、～",
        "example": "トイレがつまらないように、紙はごみ箱に捨てます。"
      },
      {
        "pattern": "V-（ら）れます　＜受身②＞",
        "example": "お店の店長さんに、「今度から気をつけて」と注意されました。"
      },
      {
        "pattern": "S（普通形）の？",
        "example": "お金を払わないで、ジュース飲んだの？"
      },
      {
        "pattern": "V-なきゃ",
        "example": "ちゃんとお金を払ってから飲まなきゃ。"
      }
    ],
    "11": [
      {
        "pattern": "V-てみてもいいですか？",
        "example": "このセーター、着てみてもいいですか？"
      },
      {
        "pattern": "ナA-／イA- すぎます",
        "example": "この色はちょっと派手すぎます。"
      },
      {
        "pattern": "イA-すぎます",
        "example": "このジャケットは高すぎます。"
      },
      {
        "pattern": "ナA-な／イA-い の",
        "example": "もうちょっと大きいの、ありますか？"
      },
      {
        "pattern": "NをV-(ら)れます　＜受身③＞",
        "example": "（私は）自転車を盗まれました。"
      },
      {
        "pattern": "S（普通形）かもしれません",
        "example": "もしかしたら、バッグをとられたかもしれません。"
      },
      {
        "pattern": "V-てしまいました",
        "example": "ポイントカード、忘れてしまいました。"
      }
    ],
    "12": [
      {
        "pattern": "V-るまで、～",
        "example": "手元に届くまで、2日しかかかりませんでした。"
      },
      {
        "pattern": "V-にくいです",
        "example": "この掃除機は、重くて、使いにくいですね。"
      },
      {
        "pattern": "V-やすいです",
        "example": "トーシマの掃除機のほうが動かしやすいですよ。"
      },
      {
        "pattern": "N1とN2（と）、どちら／どっちが～か？",
        "example": "どっちが使いやすいですか？"
      },
      {
        "pattern": "（N1より）N2のほうが～",
        "example": "トーシマの方がミツバシより軽くて、動かしやすいですよ。"
      }
    ],
    "13": [
      {
        "pattern": "V-（ら）れます　＜受身④＞",
        "example": "この建物は、2年前に建てられました。"
      },
      {
        "pattern": "V-てあります",
        "example": "昔、使われた道具とか、いろいろな資料を展示してあります。"
      },
      {
        "pattern": "N1だけじゃなくて、N2も～",
        "example": "本だけじゃなくて、CDとか、DVDもただで借りられます。"
      },
      {
        "pattern": "Nなら、～",
        "example": "返却は、市内の図書館なら、どこに返してもいいです。"
      },
      {
        "pattern": "【疑問詞】V-ても、～",
        "example": "返却は、市内の図書館なら、どこに返してもいいです。"
      }
    ],
    "14": [
      {
        "pattern": "ナA-に／イA-く V",
        "example": "全体的に短く切ってください。"
      },
      {
        "pattern": "Nのために、～",
        "example": "外国の方のために、いろいろなサービスがあります。"
      }
    ],
    "15": [
      {
        "pattern": "V-たままです",
        "example": "会議室の電気がついたままでしたよ。"
      },
      {
        "pattern": "V-るのにいいです",
        "example": "マイストローは、ごみを減らすのにいいんですよ。"
      }
    ],
    "16": [
      {
        "pattern": "V(命令形）　\nV-るな（禁止の命令形）",
        "example": "急げ。こっちに集まれ。\n走るな。"
      },
      {
        "pattern": "V-ないようにしてください",
        "example": "できるだけ煙を吸わないようにしてください。"
      },
      {
        "pattern": "V-（られ）なくなります",
        "example": "ドアが開かなくなると、外に逃げられなくなります。"
      },
      {
        "pattern": "Sても、～",
        "example": "大きな地震が来ても、あわてて動かないでください。"
      },
      {
        "pattern": "V（普通形）かどうか、～",
        "example": "店が開いているかどうか、わからないけど…。"
      }
    ],
    "17": [
      {
        "pattern": "V-（られ）るように なりました",
        "example": "最近は、ほかの人にお店の情報を教えられるようになりました。"
      }
    ],
    "18": [
      {
        "pattern": "V-（よ）うと思います／思っています",
        "example": "将来は、タイで、自分の会社を作ろうと思います。"
      },
      {
        "pattern": "V-るために、～",
        "example": "日本に住むために、もっと日本語をがんばろうと思います。"
      },
      {
        "pattern": "V-てあげます",
        "example": "両親に、家を建ててあげるつもりです。"
      },
      {
        "pattern": "V-てもらいます",
        "example": "JF工業のみなさんには、とても親切にしてもらいました。"
      },
      {
        "pattern": "V-てくれます",
        "example": "山内さんは、私にたくさん、日本語を教えてくれました。"
      }
    ]
  },
  "preintermediate": {
    "1": [
      {
        "pattern": "Nでしたっけ？",
        "example": "フットサルって、何でしたっけ？"
      },
      {
        "pattern": "V-ることになった",
        "example": "私の友だちが、バリ舞踊を踊ることになったんです。"
      },
      {
        "pattern": "V-てくれませんか？",
        "example": "もしよかったら、見に来てくれませんか？"
      }
    ],
    "2": [
      {
        "pattern": "S（plain-form 普通形）でしょう？",
        "example": "おもしろかったでしょう？"
      },
      {
        "pattern": "S（plain-form 普通形）気がする",
        "example": "ストーリーがちょっと短かった気がしました。"
      },
      {
        "pattern": "S（plain-form 普通形）ってN",
        "example": "歴史を変えようとする敵と戦うってゲームです。"
      },
      {
        "pattern": "Connecting expressions 接続の表現",
        "example": "それに、ゲームだけじゃなくて、舞台とかミュージカルとかアニメとかもあって、いろいろ楽しめるんです。"
      }
    ],
    "3": [
      {
        "pattern": "S（plain-form 普通形）なら、～",
        "example": "住むなら、どのあたりがおすすめですか？"
      },
      {
        "pattern": "Nっぽい",
        "example": "下町っぽい雰囲気ですね。"
      },
      {
        "pattern": "ありがたいです",
        "example": "V-てもらえたら、 助かります"
      }
    ],
    "4": [
      {
        "pattern": "S（plain-form 普通形）みたいだ",
        "example": "買い物に行ったときになくしたみたいです。"
      },
      {
        "pattern": "お＋N",
        "example": "お電話番号、お願いします。"
      },
      {
        "pattern": "おVください",
        "example": "お部屋でお待ちください。"
      },
      {
        "pattern": "V-（ら）れる ＜Passive 受身⑤：Suffering passive 迷惑の受身＞",
        "example": "遅い時間に音を出されると困る人もいますからね。"
      }
    ],
    "5": [
      {
        "pattern": "N1みたいなN2",
        "example": "（サイウアは）ソーセージみたいな料理で、タイの北部の名物です。"
      },
      {
        "pattern": "ナA-さ",
        "example": "頼めば、本場の辛さにしてくれます。"
      },
      {
        "pattern": "S（plain-form 普通形）やつ",
        "example": "これをさらに丸めて、油で揚げたやつが、ドゥル天なんですよ。"
      }
    ],
    "6": [
      {
        "pattern": "V-ておく",
        "example": "餃子とかうどんとか、まとめて買っておくと便利ですよ。"
      },
      {
        "pattern": "Vがち",
        "example": "コンビニや外食に頼りがちな一人暮らし。"
      },
      {
        "pattern": "S（plain-form 普通形）じゃないですか",
        "example": "外食って、やっぱりお金がかかるじゃないですか。"
      }
    ],
    "7": [
      {
        "pattern": "V-ば、～",
        "example": "興味があるイベントに参加すれば、知り合いもできると思います。"
      },
      {
        "pattern": "V-ているうちに、～",
        "example": "通っているうちに、少しずつ話ができる人が増えると思います。"
      },
      {
        "pattern": "と思っています",
        "example": "いいなと思います"
      }
    ],
    "8": [
      {
        "pattern": "Vなさい",
        "example": "これからは、気をつけなさい。"
      },
      {
        "pattern": "Respectful verbs 尊敬の動詞 ＜Respectful expressions 尊敬語①＞",
        "example": "ここには、よくいらっしゃるんですか？"
      },
      {
        "pattern": "V-（さ）せる ＜Causative 使役①＞",
        "example": "唇の両端を軽く上げるだけで、「この人、感じが良さそうだな」と思わせることができます。"
      },
      {
        "pattern": "いいです",
        "example": "無理に大きな笑顔を作らなくてもいいです。"
      }
    ],
    "9": [
      {
        "pattern": "V-る間に、～",
        "example": "日本にいる間に、いろいろなドラマを見たいから、鵜澤くんもおすすめのドラマがあったら、ぜひ教えて。"
      },
      {
        "pattern": "Polite style and plain style 丁寧体・普通体②",
        "example": "日本のドラマが好きだから、よく見るんだけど、聞き取れないセリフがあるのが悔しいんだよね。"
      },
      {
        "pattern": "Vはじめる",
        "example": "最初は吹き替えで見てたんだけど、日本語でセリフがわかるようになりたくて、勉強しはじめたんだ。"
      },
      {
        "pattern": "Expressions used to state a hope 希望を言うときの表現",
        "example": "将来は、勉強したことを活かして、アニメとかゲームとかのキャラクターをデザインする仕事が"
      }
    ],
    "10": [
      {
        "pattern": "V（plain-form 普通形）＋N ③",
        "example": "アニメ・マンガを入り口として、日本語を勉強するサイトです。"
      },
      {
        "pattern": "Expressions ending with nouns 名詞で終わる言い方",
        "example": "国際交流基金が運営する日本語学習プラットフォーム。"
      },
      {
        "pattern": "【quantity 数量】も",
        "example": "3回も見るの？ すごいね。"
      },
      {
        "pattern": "V-てくる",
        "example": "自分の言いたいことが日本語で言えるようになってきたと思う。"
      }
    ],
    "11": [
      {
        "pattern": "V-てほしいんですが",
        "example": "このメールを見てほしいんですが……。"
      },
      {
        "pattern": "Nになっている",
        "example": "缶ジュースは持ち込み禁止になっています。"
      },
      {
        "pattern": "V-ていただけますか？",
        "example": "身分証明書を見せていただけますか？"
      },
      {
        "pattern": "おVになる ＜Respectful expressions 尊敬語②＞",
        "example": "それとも、戻って、お飲みになりますか？"
      },
      {
        "pattern": "V-ることがある",
        "example": "在留カードを持っていないと、罰金を支払うことがあります。"
      }
    ],
    "12": [
      {
        "pattern": "おVです ＜Respectful expressions 尊敬語③＞",
        "example": "何かお困りですか？"
      },
      {
        "pattern": "V-（ら）れる ＜Respectful expressions 尊敬語④＞",
        "example": "（こちらのお客様が）英語を話されているんですけど、よくわからなくて……。"
      },
      {
        "pattern": "S（plain-form 普通形）ようだ",
        "example": "転んで足をけがしているようです。"
      },
      {
        "pattern": "イA-がる",
        "example": "ずっと「痛い、痛い」と言って、とても痛がっています。"
      },
      {
        "pattern": "V-（さ）せる ＜Causative 使役②＞",
        "example": "すぐ救急車を向かわせます。"
      },
      {
        "pattern": "V-ることにする",
        "example": "私も、災害に備えて防災リュックを買うことにしました。"
      }
    ],
    "13": [
      {
        "pattern": "S（plain-form 普通形）らしい",
        "example": "カンボジアに帰って、両親といっしょにお店を始めるらしいですよ。"
      },
      {
        "pattern": "V-（よ）うと思うんですが",
        "example": "来月、恋人の誕生日なので、何かプレゼントしようと思うんですが、何がいいか迷ってるんです。"
      },
      {
        "pattern": "Nとか、いいんじゃないですか？",
        "example": "S（plain-form 普通形）のがいいんじゃないですか？"
      },
      {
        "pattern": "V-てくださる",
        "example": "まだ日本語が上手ではない私たちを、やさしく教えてくださいました。"
      },
      {
        "pattern": "V-（さ）せていただく",
        "example": "本日は、友人を代表して、お祝いのスピーチをさせていただきます。"
      }
    ],
    "14": [
      {
        "pattern": "Nにとって",
        "example": "私にとって、大切な親友なんです。"
      },
      {
        "pattern": "ナA-な",
        "example": "ちょっと頑固なところがあるんです。"
      },
      {
        "pattern": "S（plain-form 普通形）のに、～",
        "example": "最初のころは、毎日メッセージをやりとりしていたのに、最近はメッセージを送っても、"
      },
      {
        "pattern": "Nのことで",
        "example": "ルームシェアをしている友人のことで悩んでいます。"
      }
    ],
    "15": [
      {
        "pattern": "Suspended form 連用中止",
        "example": "「みはらしの丘」が一面ネモフィラの青に染まり、空と地面の境目がわからないほどの絶景が広がります。"
      },
      {
        "pattern": "N1＋particle助詞＋ のN2",
        "example": "公園へのアクセスはJR勝田駅からバスで約15分。"
      },
      {
        "pattern": "もしSば、～",
        "example": "もし時間とお金があれば、ぜひ行ってみたいのは、小笠原です。"
      }
    ],
    "16": [
      {
        "pattern": "V-たところだ",
        "example": "ちょうどいまお昼食べたところ。"
      },
      {
        "pattern": "もらえますか？",
        "example": "V-て もらってもいいですか？"
      },
      {
        "pattern": "Nになります",
        "example": "1名様2,000円なので、3名様で6,000円になります。"
      },
      {
        "pattern": "Humble verbs 謙譲の動詞 ＜Humble expressions 謙譲語①＞",
        "example": "確認いたしますので、少々お待ちください。"
      },
      {
        "pattern": "おVする けんじょうご",
        "example": "＜Humble expressions 謙譲語②＞"
      },
      {
        "pattern": "V-さ（せら）れる ＜Causative-passive 使役受身＞",
        "example": "お昼ご飯を食べるお店もなかなか決まらなくて、たくさん歩かされた。"
      }
    ],
    "17": [
      {
        "pattern": "Nでございます",
        "example": "はい、JF水産でございます。"
      },
      {
        "pattern": "V-ること",
        "example": "指定の制服を着用すること。"
      },
      {
        "pattern": "おも",
        "example": "と思います"
      }
    ],
    "18": [
      {
        "pattern": "V-ていた",
        "example": "アルバイトを始める前は、夜のシフトはつらいって聞いていたんですけど、そんなことないですよ。"
      },
      {
        "pattern": "初中級 L18 - 30 ©The Japan Foundation",
        "example": "過去のある時点"
      },
      {
        "pattern": "Respectful and humble expressions 尊敬語と謙譲語",
        "example": "例えば、この間は、雨の日にタクシーでお着きになったお客様がいらっしゃったんです。"
      }
    ]
  }
}
